name: "ocr_pipeline"
backend: "python"
max_batch_size: 0

input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]  # height, width, channels (RGB)
  }
]

output [
{
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ -1 ]
}
]

instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]
